coconut/app/controllers/seats_controller.rb

SELECT * FROM "flights" WHERE ("flights"."id" = 2)
---
  def flight_seats
  	@flight=Flight.find(params[:flight_id])

SELECT * FROM "seats"
---
  def index
    @seats = Seat.all

SELECT * FROM "seats" WHERE ("seats"."id" = 25)
---
  def show
    @seat = Seat.find(params[:id])

INSERT INTO "seats" ("name", "updated_at", "flight_id", "baggage", "created_at") VALUES('Fauziah Mafoz', '2009-08-01 09:19:40', 1, 22.0, '2009-08-01 09:19:40')
---
  def create
  	@seat=Seat.new(params[:seat])
  	render :update do |page|
  		if @seat.save